## Lambda functions

In [14]:
s =  lambda  x : x**2
s(5)

25

In [13]:
add = lambda x,y,z : x**2+y**2+z**2
add(1,2,3)

14

In [27]:
import math as m
circle = lambda a : (a**2) * m.pi
circle(2)

12.566370614359172

## Map functions

In [32]:
l = [1,2,3,4,5,6,7,8,9,10]
n = list(map(lambda x :x**2,l))
n

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [44]:
l1 = [20,30,40,60]
f = list(map(lambda x : (x*9)/5 +32 ,l1))
f

[68.0, 86.0, 104.0, 140.0]

## Filter functions

In [55]:
l2 = list(range(11))
print(l2)
odd = list(filter(lambda x : x%2!=0,l2))
odd

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

[1, 3, 5, 7, 9]

In [58]:
l3 = range(101)
fives = list(filter(lambda x : x%5==0,l3))
fives

[0,
 5,
 10,
 15,
 20,
 25,
 30,
 35,
 40,
 45,
 50,
 55,
 60,
 65,
 70,
 75,
 80,
 85,
 90,
 95,
 100]

In [74]:
# below code Logic
10.5%1

0.5

In [60]:
10.5//

10.0

In [73]:
l5 = list(range(101))
ps = list(filter(lambda x : x**(1/2)%1==0,l5))
ps

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [83]:
from functools import reduce
l = list(range(11))
l = reduce(lambda x,y:x+y,l)
l

55

## Data frames

In [98]:
import numpy as np
import pandas as pd
l6 = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12],[13,14,15]])
arr = np.array(l6)
d = {'a':[1,2,3,4],'b':[11,'python',1,5],'c':[12,'data',1,2.5]}
df1 = pd.DataFrame(l6)
df1

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [97]:
df2 = pd.DataFrame(arr)
df2

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [101]:
df3 = pd.DataFrame(d)
df3

   a       b     c
0  1      11    12
1  2  python  data
2  3       1     1
3  4       5   2.5

In [122]:
l8 = [[1,2,3,4,5],[11,12,13,14],[21,22,23,24]]
cols = ['a','b','c','d','e']
rows = ['p','q','r']
df = pd.DataFrame(l8,index=['p','q','r'],columns=['a','b','c','d','e'])
df

    a   b   c   d    e
p   1   2   3   4  5.0
q  11  12  13  14  NaN
r  21  22  23  24  NaN

In [119]:
l8 = [[1,2,3,4,5],[11,12,13,14],[21,22,23,24]]
cols = ['a','b','c','d','e']
rows = ['p','q','r']
df = pd.DataFrame(l8,rows,cols)
df

    a   b   c   d    e
p   1   2   3   4  5.0
q  11  12  13  14  NaN
r  21  22  23  24  NaN

In [136]:
row = ['Name','Age','Weight','Height']
l = [['Tom','sam','reema','danny','ritha','geeta','sunny'],[22,25,26,23,22,23,25],[49,50,51,55,50,61,75],[155,153,133,160,182,195,190]]
df5 = pd.DataFrame(l,row)
df5

          0    1      2      3      4      5      6
Name    Tom  sam  reema  danny  ritha  geeta  sunny
Age      22   25     26     23     22     23     25
Weight   49   50     51     55     50     61     75
Height  155  153    133    160    182    195    190

In [243]:
col = ['Name','Age','Weight','Height']
row = [1,2,3,4,5,6,7]
l = [['Tom',22,49,155],['sam',25,50,153],['reema',26,51,154],['danny',26,60,155],['ritha',25,65,160],['geeta',26,65,162],['sunny',29,95,145]]
l
df6 = pd.DataFrame(l,row,col)
df6

    Name  Age  Weight  Height
1    Tom   22      49     155
2    sam   25      50     153
3  reema   26      51     154
4  danny   26      60     155
5  ritha   25      65     160
6  geeta   26      65     162
7  sunny   29      95     145

## LOC & ILOC

In [173]:
df6.loc[4:'Age']
#df6.iloc[0] # get only rows or only columns using loc & iloc

    Name  Age  Weight  Height
4  danny   26      60     155
5  ritha   25      65     160
6  geeta   26      65     162
7  sunny   29      95     145

In [246]:
new = [1,2,3,4,5,6,7]
df6['new'] = new
df6

    Name  Age  Weight  Height  new
1    Tom   22      49     155    1
2    sam   25      50     153    2
3  reema   26      51     154    3
4  danny   26      60     155    4
5  ritha   25      65     160    5
6  geeta   26      65     162    6
7  sunny   29      95     145    7

In [247]:
df6.set_index('new')
df6

    Name  Age  Weight  Height  new
1    Tom   22      49     155    1
2    sam   25      50     153    2
3  reema   26      51     154    3
4  danny   26      60     155    4
5  ritha   25      65     160    5
6  geeta   26      65     162    6
7  sunny   29      95     145    7

In [239]:
#df6.set_index('Age',inplace=True)